import 'dart:ui';

import 'package:flutter/material.dart';

class data {


  static List first = ["शुभकामनाये शायरी",
    "दोस्ती शायरी",
    "मजेदार शायरी",
    "भगवान शायरी",
    "प्रेरणा स्त्रोत शायरी",
    "जीवन शायरी",
    "मोहब्बत शायरी",
    "याद शायरी",
    "अन्य शायरी",
    "अन्य शायरी",
    "अन्य शायरी",
    "अन्य शायरी",
    "राजनीति शायरी",
    "प्रेम शायरी",
    "दर्द शायरी",
    "शराब शायरी",
    "बेवफा शायरी",
    "जन्मदिन शायरी",
    "जन्मदिन शायरी",
    "जन्मदिन शायरी",
    "जन्मदिन शायरी",
    "जन्मदिन शायरी",
    "होली शायरी"];

  static List images = [
    "assests/images/1.png",
    "assests/images/2.png",
    "assests/images/3.png",
    "assests/images/4.png",
    "assests/images/5.png",
    "assests/images/6.png",
    "assests/images/7.png",
    "assests/images/1.png",
    "assests/images/2.png",
    "assests/images/3.png",
    "assests/images/4.png",
    "assests/images/5.png",
    "assests/images/6.png",
    "assests/images/7.png",
    "assests/images/6.png",
    "assests/images/7.png",
  ];

  static List shubh = [
    """ये इश्क भी एक अजीब एहसास होता है…
   अल्ज़फों से ज्यादा निगाहोसे बया होता है…
   हर पल बस उसके गम और खुशी की फ़िक्र होती है…
   इसी एहसास से तो हमको जीने का गुमान होता है…""",

    """ज़िंदगी में अगर तुम अकेले हो तो प्यार करना सिख़लो
  और प्यार कर लिया हैं तो इज़हार करने भी सिख़लो.
  अगर इज़हार करना नही सीखा तो
  ज़िंदगी भर प्यार के यादों में रोना सिख़लो…""",

    """वफ़ा का दरिया कभी रुकता नही
   इश्क़ में प्रेमी कभी झुकता नही
   खामोश हैं हम किसी के खुशी के लिए
   ना सोचो के हमारा दिल दुःखता नहीं!""",

    """बरसात आये तो ज़मीन गीली न हो
  धूप आये तो सरसों पीली न हो
  ए दोस्त तूने यह कैसे सोच लिया कि
  तेरी याद आये और पलकें गीली न हों।
  """,

    """ जा SMS जा मेरे sweetheart के पास
  धीरे से जाना शोर न मचाना
  busy हो तो चुप रहना
  free हो तो आई मिस यू कहना
  """,

    """लोग कहते हैं किसी एक के चले जाने से जिन्दगी अधूरी नहीं होती
  लेकिन लाखों के मिल जाने से उस एक की कमी पूरी नहीं होती है
  """
  ];
  static List dosti = [

    """मत मुस्कुराओ इतना की फूलो को खबर लग जाये
   हम करें आपकी तारीफ और आपको नजर लग जाये
   खुदा करे बहुत लम्बी हो आपकी जिंदगी 
   और उस पर भी हमारी उम्र लग जाये….""",

    """बीते साल को विदा इस तरह करते है.
   जो नहीं किया अब तक वो भी कर गुजरते है.
   नया साल आने के खुशिया तो सब मानते है.
   एक बार हम इते साल कि जस्न मानते है.
   """,

    """हर पल मे खुशी देती है मा
  अपनी ज़िंदगी से जीवन देती है मा
  भगवान क्या है!!! मा की पूजा करो जनाब
  क्यूकी भगवान को भी जनम देती है मा…
   """,

  ];
  static List majedar = [
    """ना इश्क़ करो झूठा, ना प्यार करो फर्जी,
आगे नहीं बताऊंगा, मेरा शेर मेरी मर्ज़ी!!""",

    """उसने कहा मेरे दिल में तेरे लिए कोई जगह नहीं
मैंने कहा दीमाग में रख लो वह तो खाली है""",

    """हे ऊपरवाले थोडी महिमा दिखा दे
जो reply  ना दे उसके फोन का Display  उड़ा दे""",
    """ज़िंदगी ने दिए हैं बहुत से धोखे
   but
 कोई बात नहीं its ok""",

    """अर्ज किया है
गुजर रहें है आज हम उस मुकाम से
लोग छोड़ रहें हैं साथ जरा से जुकाम से""",

    """उन्होंने आज हम पर तिरछी नज़र डाली तो हम मदहोश हो गए
बाद में पता चला नजर ही तिरछी है
तो हम बेहोश हो गए""",
  ];
  static List bhagwan = [
    """हारने ना देना मेरे प्रभु कठिन इम्तेहान है…

जीत में ही प्रभु हम दोनों का मान है…

क्योंकि आपके भरोसे हूँ मैं यही मेरी पहचान है…

जय माँ जगदम्बा""",
    """राधा नाम के रस में तन मन भीग जाता है​…

​सुनकर राधा नाम तो साँवरिया भी रीझ जाता है​…

​चाहे भक्ति का मार्ग हो या दुखों का चक्रव्युह…

राधा नाम लेने वाला​ हर परिस्थिती में जीत जाता है…

प्रेम से बोलो राधे राधे""",
    """जब भटक भटक कर हार गया…

और कदम कदम पर ठुकराया गया तब…

आपका ही द्वार नजर आया मुझको मेरे श्याम…

तेरे ही चरणों में सुख पाया…

जय श्री कृष्णा""",
    """तुम हो तो मैं हूँ साँवरे दिल में मेरे तुम बसते हो…

अब और कहीं नहीं जाना तुम्हें छोड़कर…

इस जिंदगी की हर साँस में तुम हो साँवरे…

जय श्री श्याम""",
    """भगवान वह नहीं जो मन की मनोकामनाओं को…

पूरा करता हो बल्कि भगवान वह है जो…

मन से मनोकामनाओं का नाश करता हो…

जय श्री राम जी""",
    """मेरे श्याम तुझे देखकर यह निगाह रुक जायेगी…

खामोशी अब हर बात कह जायेगी…

पढ़ लो अब इन आँखों में अपनी मोहब्बत…

कसम से सारी कायनात इसे सुनने को थम जायेगी…

जय श्री राधे किसन""",
  ];
  static List jivan = [
    """हम आह भी करते हैं तो हो जाते हैं बदनाम 

वो क़त्ल भी करते हैं तो चर्चा नहीं होता """,
    """इश्क़ ने 'ग़ालिब' निकम्मा कर दिया 

वर्ना हम भी आदमी थे काम के """,
    """सितारों से आगे जहाँ और भी हैं 

अभी इश्क़ के इम्तिहाँ और भी हैं """,
    """मैं अकेला ही चला था जानिब-ए-मंज़िल मगर 

लोग साथ आते गए और कारवाँ बनता गया """,
    """उन के देखे से जो आ जाती है मुँह पर रौनक़ 

वो समझते हैं कि बीमार का हाल अच्छा है """,
  ];
  static List mohbat = [
    """ना इश्क़ करो झूठा, ना प्यार करो फर्जी,
आगे नहीं बताऊंगा, मेरा शेर मेरी मर्ज़ी!!""",

    """उसने कहा मेरे दिल में तेरे लिए कोई जगह नहीं
मैंने कहा दीमाग में रख लो वह तो खाली है""",

    """हे ऊपरवाले थोडी महिमा दिखा दे
जो reply  ना दे उसके फोन का Display  उड़ा दे""",
    """ज़िंदगी ने दिए हैं बहुत से धोखे
   but
 कोई बात नहीं its ok""",

    """अर्ज किया है
गुजर रहें है आज हम उस मुकाम से
लोग छोड़ रहें हैं साथ जरा से जुकाम से""",

    """उन्होंने आज हम पर तिरछी नज़र डाली तो हम मदहोश हो गए
बाद में पता चला नजर ही तिरछी है
तो हम बेहोश हो गए""",
  ];
  static List yad = [
    """हारने ना देना मेरे प्रभु कठिन इम्तेहान है…

जीत में ही प्रभु हम दोनों का मान है…

क्योंकि आपके भरोसे हूँ मैं यही मेरी पहचान है…

जय माँ जगदम्बा""",
    """राधा नाम के रस में तन मन भीग जाता है​…

​सुनकर राधा नाम तो साँवरिया भी रीझ जाता है​…

​चाहे भक्ति का मार्ग हो या दुखों का चक्रव्युह…

राधा नाम लेने वाला​ हर परिस्थिती में जीत जाता है…

प्रेम से बोलो राधे राधे""",
    """जब भटक भटक कर हार गया…

और कदम कदम पर ठुकराया गया तब…

आपका ही द्वार नजर आया मुझको मेरे श्याम…

तेरे ही चरणों में सुख पाया…

जय श्री कृष्णा""",
    """तुम हो तो मैं हूँ साँवरे दिल में मेरे तुम बसते हो…

अब और कहीं नहीं जाना तुम्हें छोड़कर…

इस जिंदगी की हर साँस में तुम हो साँवरे…

जय श्री श्याम""",
    """भगवान वह नहीं जो मन की मनोकामनाओं को…

पूरा करता हो बल्कि भगवान वह है जो…

मन से मनोकामनाओं का नाश करता हो…

जय श्री राम जी""",
    """मेरे श्याम तुझे देखकर यह निगाह रुक जायेगी…

खामोशी अब हर बात कह जायेगी…

पढ़ लो अब इन आँखों में अपनी मोहब्बत…

कसम से सारी कायनात इसे सुनने को थम जायेगी…

जय श्री राधे किसन""",
  ];
  static List prem = [
    """हम आह भी करते हैं तो हो जाते हैं बदनाम 

वो क़त्ल भी करते हैं तो चर्चा नहीं होता """,
    """इश्क़ ने 'ग़ालिब' निकम्मा कर दिया 

वर्ना हम भी आदमी थे काम के """,
    """सितारों से आगे जहाँ और भी हैं 

अभी इश्क़ के इम्तिहाँ और भी हैं """,
    """मैं अकेला ही चला था जानिब-ए-मंज़िल मगर 

लोग साथ आते गए और कारवाँ बनता गया """,
    """उन के देखे से जो आ जाती है मुँह पर रौनक़ 

वो समझते हैं कि बीमार का हाल अच्छा है """,
  ];
  static List any = [
    """ना इश्क़ करो झूठा, ना प्यार करो फर्जी,
आगे नहीं बताऊंगा, मेरा शेर मेरी मर्ज़ी!!""",

    """उसने कहा मेरे दिल में तेरे लिए कोई जगह नहीं
मैंने कहा दीमाग में रख लो वह तो खाली है""",

    """हे ऊपरवाले थोडी महिमा दिखा दे
जो reply  ना दे उसके फोन का Display  उड़ा दे""",
    """ज़िंदगी ने दिए हैं बहुत से धोखे
   but
 कोई बात नहीं its ok""",

    """अर्ज किया है
गुजर रहें है आज हम उस मुकाम से
लोग छोड़ रहें हैं साथ जरा से जुकाम से""",

    """उन्होंने आज हम पर तिरछी नज़र डाली तो हम मदहोश हो गए
बाद में पता चला नजर ही तिरछी है
तो हम बेहोश हो गए""",
  ];
  static List rajniti = [
    """हारने ना देना मेरे प्रभु कठिन इम्तेहान है…

जीत में ही प्रभु हम दोनों का मान है…

क्योंकि आपके भरोसे हूँ मैं यही मेरी पहचान है…

जय माँ जगदम्बा""",
    """राधा नाम के रस में तन मन भीग जाता है​…

​सुनकर राधा नाम तो साँवरिया भी रीझ जाता है​…

​चाहे भक्ति का मार्ग हो या दुखों का चक्रव्युह…

राधा नाम लेने वाला​ हर परिस्थिती में जीत जाता है…

प्रेम से बोलो राधे राधे""",
    """जब भटक भटक कर हार गया…

और कदम कदम पर ठुकराया गया तब…

आपका ही द्वार नजर आया मुझको मेरे श्याम…

तेरे ही चरणों में सुख पाया…

जय श्री कृष्णा""",
    """तुम हो तो मैं हूँ साँवरे दिल में मेरे तुम बसते हो…

अब और कहीं नहीं जाना तुम्हें छोड़कर…

इस जिंदगी की हर साँस में तुम हो साँवरे…

जय श्री श्याम""",
    """भगवान वह नहीं जो मन की मनोकामनाओं को…

पूरा करता हो बल्कि भगवान वह है जो…

मन से मनोकामनाओं का नाश करता हो…

जय श्री राम जी""",
    """मेरे श्याम तुझे देखकर यह निगाह रुक जायेगी…

खामोशी अब हर बात कह जायेगी…

पढ़ लो अब इन आँखों में अपनी मोहब्बत…

कसम से सारी कायनात इसे सुनने को थम जायेगी…

जय श्री राधे किसन""",
  ];
  static List dard = [
    """हम आह भी करते हैं तो हो जाते हैं बदनाम 

वो क़त्ल भी करते हैं तो चर्चा नहीं होता """,
    """इश्क़ ने 'ग़ालिब' निकम्मा कर दिया 

वर्ना हम भी आदमी थे काम के """,
    """सितारों से आगे जहाँ और भी हैं 

अभी इश्क़ के इम्तिहाँ और भी हैं """,
    """मैं अकेला ही चला था जानिब-ए-मंज़िल मगर 

लोग साथ आते गए और कारवाँ बनता गया """,
    """उन के देखे से जो आ जाती है मुँह पर रौनक़ 

वो समझते हैं कि बीमार का हाल अच्छा है """,
  ];
  static List srab = [
    """ना इश्क़ करो झूठा, ना प्यार करो फर्जी,
आगे नहीं बताऊंगा, मेरा शेर मेरी मर्ज़ी!!""",

    """उसने कहा मेरे दिल में तेरे लिए कोई जगह नहीं
मैंने कहा दीमाग में रख लो वह तो खाली है""",

    """हे ऊपरवाले थोडी महिमा दिखा दे
जो reply  ना दे उसके फोन का Display  उड़ा दे""",
    """ज़िंदगी ने दिए हैं बहुत से धोखे
   but
 कोई बात नहीं its ok""",

    """अर्ज किया है
गुजर रहें है आज हम उस मुकाम से
लोग छोड़ रहें हैं साथ जरा से जुकाम से""",

    """उन्होंने आज हम पर तिरछी नज़र डाली तो हम मदहोश हो गए
बाद में पता चला नजर ही तिरछी है
तो हम बेहोश हो गए""",
  ];
  static List bevfa = [
    """हारने ना देना मेरे प्रभु कठिन इम्तेहान है…

जीत में ही प्रभु हम दोनों का मान है…

क्योंकि आपके भरोसे हूँ मैं यही मेरी पहचान है…

जय माँ जगदम्बा""",
    """राधा नाम के रस में तन मन भीग जाता है​…

​सुनकर राधा नाम तो साँवरिया भी रीझ जाता है​…

​चाहे भक्ति का मार्ग हो या दुखों का चक्रव्युह…

राधा नाम लेने वाला​ हर परिस्थिती में जीत जाता है…

प्रेम से बोलो राधे राधे""",
    """जब भटक भटक कर हार गया…

और कदम कदम पर ठुकराया गया तब…

आपका ही द्वार नजर आया मुझको मेरे श्याम…

तेरे ही चरणों में सुख पाया…

जय श्री कृष्णा""",
    """तुम हो तो मैं हूँ साँवरे दिल में मेरे तुम बसते हो…

अब और कहीं नहीं जाना तुम्हें छोड़कर…

इस जिंदगी की हर साँस में तुम हो साँवरे…

जय श्री श्याम""",
    """भगवान वह नहीं जो मन की मनोकामनाओं को…

पूरा करता हो बल्कि भगवान वह है जो…

मन से मनोकामनाओं का नाश करता हो…

जय श्री राम जी""",
    """मेरे श्याम तुझे देखकर यह निगाह रुक जायेगी…

खामोशी अब हर बात कह जायेगी…

पढ़ लो अब इन आँखों में अपनी मोहब्बत…

कसम से सारी कायनात इसे सुनने को थम जायेगी…

जय श्री राधे किसन""",
  ];
  static List holi = [
    """हम आह भी करते हैं तो हो जाते हैं बदनाम 

वो क़त्ल भी करते हैं तो चर्चा नहीं होता """,
    """इश्क़ ने 'ग़ालिब' निकम्मा कर दिया 

वर्ना हम भी आदमी थे काम के """,
    """सितारों से आगे जहाँ और भी हैं 

अभी इश्क़ के इम्तिहाँ और भी हैं """,
    """मैं अकेला ही चला था जानिब-ए-मंज़िल मगर 

लोग साथ आते गए और कारवाँ बनता गया """,
    """उन के देखे से जो आ जाती है मुँह पर रौनक़ 

वो समझते हैं कि बीमार का हाल अच्छा है """,
  ];
  static List birthday = [
    """आ तेरी उम्र में लिख दूँ 🌙✨चाँद-सितारों🌙✨ से,
तेरा जन्मदिन मनाऊँ फूलों से बहारों से…
हर एक खूबसूरती दुनिया 🌎 से मैं ले आउ,
सजाऊ में ये महेफिल हर हसिन नजारों से…
🎀🎁जन्मदिन की ढेर सारी शुभकामनायें…🎂🎂""",
    """दोस्त तू है मेरा सबसे न्यारा,
तुझे मुबारक हो तेरा जन्मदिन ओ यारा…
किसी की कभी नजर ना लगे तुझे,
कभी उदास ना हो ये चहेरा प्यारा 💞 प्यारा…
जन्मदिन 🎂🎀🎁 की बहोत बहोत शुभकामनायें""",
    """≛≛”*•”*•≛≛
दुनिया 🌎 कि सारी खुशियाँ मिले आपको,
खुदा से रहमत और प्यार ❤️ मिले आपको…
आपके होठों पर बनी रहे हमेशा मुस्कान😊,
दुआ 🙏 है,
उम्र के साथ साथ बढ़ते रहे आपका मान-सम्मान…
≛≛”*•”*•≛≛
🎂🎂“Happy Birthday”🎀🎁🎂
≛≛”*•”*•≛≛""",
    """एक दुआ 🙏 माँगते है हम अपने भगवान से,
चाहते है आपकी खुशी पूरे ईमान से,
सब हसरतें पूरी हो आपकी
और आप मुस्कुराएँ दिलो ❤️ जान 💗 से…
🎂🎀🎁*Happy Birthday*🎂🎂
""",
    """मैं लिख दू तुम्हारी उम्र चाँद सितारों से…
मैं मनाऊ जन्मदिन तुम्हारा फूल बहारों से
ऐसी खूबसूरती दुनिया 🌎 से लेकर आऊ मैं
के सारी महफ़िल सज जाए हसीं नजारो से
Happy 🎂 Birthday 🎂to You…🎀🎁""",
  ];
  static List perna = [
    """मेरे हौसलों में अभी जान बाकी है
ये तो दौड़ भर थी अभी उड़ान बाकी है,
मेरी सादगी से मेरे बारे में अंदाजा मत लगाना
ये तो शुरुआत भर थी अंजाम अभी बाकी है।""",
    """कोशिशें जारी हैं और हिम्मत बरकरार है
सिर पे है इस दुनिया पर छाने का फितूर,
मुझे किस्मत पर भरोसा नहीं अपनी मेहनत पर है
एक न एक दिन ये हालात बदलेंगे जरूर।""",
    """जो पूरी हो जाती आसानी से सारी ख्वाहिशें
पुरजोर मेहनत का फिर इस्तेकबाल कौन करता?
न होते जो जिन्दगी से जंग करने वाले सिपाही
तो इस दुनिया में नए-नए कमाल कौन करता?""",
    """हकीकत करने हैं वो ख्वाब जो जागती आँखों से मैंने सजाये हैं
उसे पाने के लिए मैंने न जाने कितने ही लम्हें बिताये हैं,
मिल जायेगी जल्द ही मुझे जो बनायीं है मैंने मंजिल मेरी
कट रहा है अभी सफ़र जो मैंने अपने कदम बढाये हैं।""",
    """कामयाबी उन्हीं को मिलती है
जिनके सिर पर कुछ करने का जूनून होता है,
फिर दुनिया से कोई मतलब नहीं रहता उन्हें
उनका अपने काम में ही सुकून होता है।""",
  ];

  static List<Color> mycolor =[
    Colors.red,
    Colors.blue,
    Colors.white,
    Colors.cyan,
    Colors.deepPurple,
    Colors.amber,
    Colors.blue,
    Colors.teal,
    Colors.tealAccent,
    Colors.lightGreenAccent,
    Colors.lightBlue,
    Colors.blueGrey,
    Colors.deepOrangeAccent,
    Colors.purpleAccent,
    Colors.greenAccent,
    Colors.red,
    Colors.blue,
    Colors.white,
    Colors.cyan,
    Colors.deepPurple,
    Colors.amber,
    Colors.blue,
    Colors.teal,
    Colors.tealAccent,
    Colors.lightGreenAccent,
    Colors.lightBlue,
    Colors.blueGrey,
    Colors.deepOrangeAccent,
    Colors.purpleAccent,
    Colors.greenAccent

  ];
  static List emoji=[
    "🦁🦁🦁",
    "😍😍😍",
    "👻👻👻",
    "😊😊😊",
    "🌈🌈🌈",
    "🚩🚩🚩",
    "🙃🙃🙃",
    "💖❤️‍💝",
    "🦚🦚🦚",
  ];
}